Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ནས་ ལྷ་ རྣམས་ ནི་ ཉི་མ་ ནུབ་པ འི་ ཕྱོགས་ སུ་ ལྟ །_ ལྷ་མ་ ཡིན་ རྣམས་ ནི་ ཤར་བ འི་ ཕྱོགས་ སུ་ ལྟ་ སྟེ །_
en: $254 “Now, while the gods are facing the direction where the sun sets, the asuras will look toward the rising sun.

source: དེ་ལྟ ར་ ཤར་བ འི་ འོད་ཟེར་ གྱི་ མཐུ་ དེས་ མིག་ རབ་ཏུ་ ཉམས་པ་ དང་ །_ དེ་ [34b] ནས་ ལྷ་མ་ ཡིན་ གྱི་ མཚོན་ཆ་ ཆར་ ལྟར་ འབེབས་པ་ རྣམས་ ཀྱིས །_ ལྷ་ རྣམས་ ལ་ དབབ་པ ར་ མ་ནུ ས་ སོ །_།
en: As a result, the rays of the rising sun will hurt the asuras’ eyes [34.b] so that they are unable to assail the gods with their downpour of weapons.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ མིག་ བསྒྲིབས་པ་ རྣམས་ ཕན་ཚུན་ དུ་ འདི་ལྟར་ ཉི་མ འི་ འོད་ཟེར་ རྣམས་ ཀྱིས་ མིག་ རབ་ཏུ་ ཉམས་ ཏེ །_
en: Thus blinded, the asuras will cry, ‘The sunrays have made us unable to see properly!

source: བདག་ཅག་ གིས་ ལྷ་ རྣམས་ ལ་ བརྒལ་བ ར་ མི་ ནུས་ སོ་ ཞེས་ སྨྲས་ སོ །_།
en: We cannot fight against the gods!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གྱིས་ རང་ གི་ ལག་པ ས་ ཉི་མ་ སྒྲིབ་པ ར་ བྱེད་ དེ །_
en: At that point, the asura ruler Rāhu will block the sunlight that comes toward him.

source: འདི་ ཡང་ ཉི་མ་ གཟས་ ཟིན་པ འི་ རྒྱུ་གསུམ་པ་ ཡིན་ ནོ །_།
en: $255 “This is the third cause of a solar eclipse.

source: དེ འི་ ཚེ་ རྒྱུ་ མི་ ཤེས་པ འི་ རྟོག་གེ་པ་ རྣམས་ འདི་ལྟར་ ལོ་ལེགས་ པར་ འགྱུར་ རོ །_། ལོ་ཉེས་ པར་ འགྱུར་ རོ །_།
en: Still, scholars who are ignorant about this will in this regard declare,

source: ཆར་ ཆེ ར་ ལེགས་པ ར་ འབབ་པ ར་ འགྱུར་ རོ །_།
en: ‘Good rain will fall!’

source: ཆར་ ཆུང་ངུ་ འབབ་པ ར་ འགྱུར་ རོ །_།
en: ‘There will be little rain!’

source: སྐྱེ་བོ་ འཇིག་པ ར་ འགྱུར་ རོ །_།
en: ‘People will face calamity!’

source: སྐྱེ་བོ་ འཇིག་པ ར་ མི་ འགྱུར་ རོ་ ཞེས་ བརྗོད་ དེ །_
en: ‘People will be safe!’

source: དེ་ལྟ ར་ བསྟན་བཅོས་ ངན་པ ས་ བསླུས་པ་ རྣམས་ གཞན་ དུ་ རྟོག་པ ར་ བྱེད་ དོ །_།
en: Thus, those who are deceived by unwholesome treatises will conceive things in misguided ways.

source: དེ་ལྟ ར་ སྒྲ་གཅན་ དེས་ ཉི་མ འི་ དཀྱིལ་འཁོར་ དེ་ བསྒྲིབས་ ཏེ །_ འོད་ཟེར་ ཡང་ བཟློག་ ནས་ བལྟ་བ ར་ བདེ་བ་ དང་ །_ ལྷ་ རྣམས་ མངོན་པར་ མཐོང་ ནས་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ ལ་ སྨྲས་པ
en: $256 “At this point, by covering the disk of the sun and blocking its sunlight, Rāhu is once again able to see. As he beholds the gods, he will say to the asura ruler Firm,

source: །_ ལྷ་ དག་ བདེ་བ ར་ མཐོང་ ངོ་ །_། ལྷ་མ་ ཡིན་ རྣམས་ བདེ་བ ར་ མ་ མཐོང་ གིས་ ཕ་རོལ་ ཕམ་པ ར་ བྱ་བ་ ལ་ འབོད་ ཅིག _།
en: ‘I see the gods well, but I don’t see the asuras clearly. Summon them for the victory charge!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ རྣམས་ མཚོན་ཆ འི་ ཚོགས་ རྣམས་ ཆར་ ལྟར་ མངོན་པར་ འབེབས་ ཤིང་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ བརྟན་པ ས་ སྣ་ དྲངས་ ནས་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: $257 “Then, letting their various weapons pour down like rain, the asuras will hasten forward to attack, headed by Firm.

source: ལྷ་ རྣམས་ ཀྱིས་ ཀྱང་ དེ་དག་ མཐོང་ ནས་ མཚོན་ཆ་ སྣ་ཚོགས་ ཐོགས་ ཏེ །_ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: When the gods see them charging, they too will take up arms and run toward the asuras.

source: དེ་ནས་ ཕྲེང་ཐོགས་ ཀྱི་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ བརྟན་པ་ དེ་དག་ རྒྱུག་ ཅིང་ །_ དེ་དག་ མཚོན་ཆ་ སྣ་ཚོགས་ ཀྱི་ ཆར་ མངོན་པར་ འབེབས་པ་ ན །_ ཕྲེང་ཐོགས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ དེ་དག་ མངོན་པར་ མཐོང་ ནས་ འདི་སྐད་ སྨྲས་ སོ །_།
en: As Firm advances on the garland-bearer gods, subjecting them to a downpour of weapons, the garland-bearer gods will say,

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ དག་ ལེགས་ སོ་ ལེགས་ སོ །_།
en: ‘So be it, asura rulers. So be it.

source: འདི་ལྟར་ ཁྱེད་ ལྷ་ རྣམས་ ཀྱིས་ ལན་ དུ་མ་ ཞིག་ ཏུ་ ཕམ་པ ར་ བྱས་ ཀྱང་ ཁྱེད་ ཆོས་ ལ་སོ་ སོར་ རིག་པ ར་ མི་ བྱེད་ དམ །_ ངེད་ ནི་ ཆོས་ ཀྱི་ ཚུལ་ དང་ ལྡན །_
en: The gods have defeated you numerous times, but it seems that you still do not understand about the Dharma.

source: ཆོས་ ལ་ གཞོལ །_ ཆོས་ སྒྲུབ་པ་ ཡིན་ ཏེ །_
en: We possess the way of the Dharma, we pursue the Dharma, and we practice the Dharma.

source: ངེད་ ནི་ ཆོས་མ་ སྤངས་པ ས་ རྒྱལ་བ ར་ འདོད་ [35a] དོ །_། ཁྱེད་ ནི་ བརྣབ་སེམས་ ཀྱིས་ གནོད་ དེ །_ གཞན་ གྱི་ རྫས་ ལ་ རང་ གིར་ བྱ་བ འི་ བརྣབ་སེམས་ ཡོད་ དོ །_། བརྣབ་སེམས་ མང་བ་ དེ་ ནི་ ཁྱེད་ ཡིན་ ཏེ །_
en: We seek victory without giving up the Dharma. [35.a] You, on the other hand, are afflicted by covetousness and want to take possession of things that belong to others. When it comes to covetousness, no one has more of it than you.

source: ཆོས་མ་ ཡིན་པ་ དང་ ལྡན་པ ར་ གྱུར་པ ས །_ དགེ་བ་ བཅུ འི་ ལས་ ཀྱི་ ལམ་ དང་ ཡང་དག་ པར་ ལྡན་པ །_ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ ལྷ་ རྣམས་ ཇི་ལྟ ར་ ཕམ་པ ར་ བྱ་བ ར་ འདོད །_
en: Since you are unrighteous beings, how do you intend to defeat us gods, who practice the ten virtuous courses of action, who are righteous, and who follow the Dharma?

source: མུན་པ ས་ ནི་ སྣང་གསལ་ ཆེན་པོ་ རྣམས་ ཀྱང་ ཟིལ་ གྱིས་ གནོན་པ ར་ མི་ ནུས་ སོ །_།
en: Darkness can never overcome brilliant light!’

source: དེ་ནས་ རྣམ་པ་ འདི་དག་ སྨྲས་པ་ ན །_ བརྟན་པ ས་ དེ་དག་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $258 “In response, Firm will say,

source: ཀྱེ་ མང་ དུ་ སྨྲ་ ཅི་ དགོས་ ཁྱེད་ ཀྱི་ འབྱོར་པ་ ལ་ ངེད་ རྣམས་ ཀྱང་ སྨོན་པ་ མེད་ དོ །_།
en: ‘Oh, why so much talk? We do not want any of your possessions.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ ཐགས་ བཟངས་ རིས་ དང་ །_ རབ་དགོད་ ལ་སོགས་པ་ བཞི་པོ་ འདི་དག་ གི་ དཔུང་ བཤམས་པ་ རྣམས་ ཀྱིས་ ལྷ་ ཐམས་ཅད་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ འཁོད་ དེ །_
en: Rather, the armies of Vemacitrin, Overjoyed, and the others among the four asura rulers have been mobilized to crush all the gods.

source: ངེད་ ནི་ ཁྱོད་ ཀྱི་ འབྱོར་པ་ ལ་ དགའ་བ་ མེད་ དོ །_།
en: We have no interest in your wealth.’

source: དེ་སྐད་ སྨྲས་ ནས །_ ཕྲེང་ཐོགས་ ཀྱི་ ལྷ་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: $259 “At that point the asuras will rush toward the garland-bearer gods.

source: དེ་ འོང་བ ར་ མངོན་པར་ མཐོང་ ནས །_ ཇི་ལྟ ར་ དེ འི་ ལུས་ ཀྱི་ ངོ་བོ་ ཤིན་ཏུ་ ཕྲ་བ་ ཡང་ མི་མངོན་པ་ དེ་ལྟ ར་ མདའ་ སྣ་ཚོགས་ ཆར་ ལྟར་ ཕབ་བོ །_།
en: The advancing asuras, when spotted by the latter, will release a rain of arrows so dense that not even a speck of their powerful bodies can be seen.#245

source: དེ་ལྟ ར་ བརྟན་པ་ མཚོན་ཆ འི་ ཆར་ གྱི་ ནང་ དུ་ ཚུད་ ནས་ ཀྱང་ ཕྲེང་ཐོགས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ འདི་སྐད་ སྨྲས་ སོ །_། ལས་ ཀྱིས་ བཅོམ་ ཞིང་ སྒྲུབ་པ་ བརྣབ་སེམས་ མང་པོ་ འདི་ ཅིར་ དགོས །_
en: Even as they are caught in the rain of Firm’s arrows, the garland-bearer gods will still call to him, ‘What is the point to all that covetousness—to all that karmic destruction and production?

source: ཆོས་མ་ ཡིན་པ ས་ ནི་ ནམས་ ཀྱང་ ཆོས་ ཟིལ་ གྱིས་ མནན་པ་ མེད་ དེ །_
en: Non-Dharma can never defeat the Dharma.

source: ངེད་ ནི་ ཁྱེད་ ལ་ཆུང་ ཟད་ ཀྱང་ འཚེ་བ ར་ མི་ བྱེད་ ན །_ ངེད་ ལ་ ཅི་སྟེ་ གནོད་པ་ བྱེད །_
en: We never hurt you in any way, so why do you seek to harm us?’

source: དེ་དེ་ སྐད་ སྨྲ་བ་ ན །_ ལྷ་ དེ་དག་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: Still, the asuras will continue their attack on the gods.

source: དེ་ནས་ ཕྲེང་ཐོགས་ ཀྱི་ ལྷ་ རྣམས་ ཀྱིས་ ཀླུ་ དེ་དག་ ལ་ སྨྲས་པ །_
en: $260 “At this stage, the garland-bearer gods will tell the nāgas,

source: དཔུང་ དོན་མེད་ པས་ ཁེངས་པ་ འདི་ ཁྱེད་ ཀྱིས་ མེ འི་ ཆར་ མངོན་པར་ ཕོབ་ ཤིག་ དང་ །_ འོན་ཀྱང་ དཔུང་ གི་ མཐུ་ འདི་ ཉམས་པ ར་ འགྱུར་ རོ །_།
en: ‘Release a rain of fire onto this army, which is so conceited and useless! Now, the might of that army is going to wane.’

source: དེ་སྐད་ སྨྲས་པ་ དང་ །_ ཀླུ འི་ རྒྱལ་པོ་ འཇོག་པོ ས་ ཕྱོགས་ གཅིག་ ཏུ་ ཀླུ འི་ རྒྱལ་པོ་ རབ་ འཇོམས་ ལ་ མེ འི་ ཆར་ ཕབ་པ་ དང་ །_ བརྟན་པ་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དེ
en: $261 “Thus, the nāga king Takṣaka will single out the nāga king Pramatha and release a rain of fire on him.

source: མེ འི་ ཆར་ མངོན་པར་ ཕབ་པ་ ན་ དེ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_།
en: He will also storm toward Firm and let a rain of fire descend upon him as well.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ དང་ [35b] ཀླུ་ དེ་དག་ མེ འི་ ཆར་ ཆེན་པོ འི་ ནང་ དུ་ ཆུད་པ ར་ གྱུར་ ཏོ །_།
en: Thus, the asuras [35.b] and nāgas become engulfed in a great downpour of fire.

source: དེ་ནས་ དེ་དག་ ལ་ མེ འི་ ཆར་ མངོན་པར་ ཕབ་པ་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ རི་ དཔག་ཚད་ བཅུ་པ་ གཅིག་ བླངས་ ནས །_ ཕྲེང་ཐོགས་ ཀྱི་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: As the rain of fire falls, the asura ruler Rāhu will pick up a mountain measuring eleven leagues and assail the garland-bearer gods.

source: དེ་ འོང་བ་ མངོན་པར་ མཐོང་ ནས་ ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ དག་ རི་ བསྲེག་པ འི་ ཕྱིར་ མེ འི་ ཆར་ མངོན་པར་ འབེབས་ ཤིང་ རྒྱུག་པ ར་ བྱེད་ དོ །_།
en: When the vessel-bearer gods see this, they will bring down a rain of fire to burn the mountain, and so they race toward Rāhu.

source: དེ་ནས་ མེ འི་ ཆར་ དེས་ ནི་ རི་ དེ་ ཐམས་ཅད་ བསྲེགས་ སོ །_།
en: In this way, they will succeed in burning the mountain to ashes.

source: དེ་ལྟ ར་ དེ་ བསྲེགས་པ ར་ རིག་ ནས་ བརྟན་པ་ དེ་ མཐུ་ ཉམས་ ཏེ །_ ལྷ་ དེ་ རྣམས་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $262 “When Firm sees that the mountain has been consumed by fire, his strength will weaken, but still he will say to the gods,

source: འདི་ལྟར་ བདག་ གིས་ རི་རབ་ ཏུ་ འབར་བ་ གཞན་ ཐམས་ཅད་ སྟེང་ དུ་ དབབ་བོ །_།
en: ‘I shall let other flaming mountains fall upon you all!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ རི་རབ་ ཏུ་ འབར་བ་ གཞན་ ཞིག་ དེ འི་ དྲུང་ དུ་ ཁྱེར་ རོ །_། དེ་ནས་ བརྟན་པ་ དེས་ དེ་ ཁྱེར་ ནས་ ལྷ་ རྣམས་ ཀྱི་ སྟེང་ དུ་ འཕངས་ སོ །_།
en: The asuras will then bring a burning mountain before him, and Firm will hurl it at the gods.

source: དེ་ནས་ ལྷ་ དེ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ ཆེན་པོ་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: “The gods will respond to the great asuras, saying,

source: ཆོས་མ་ ཡིན་པ ས་ ནི་ ཆོས་ ལས་ རྒྱལ་བ ར་ མི་ ནུས་ ཏེ །_ ངེད་ ནི་ ཆོས་ མདུན་ དུ་ བྱས་ ནས་ གནས་ སོ །_། ཁྱེད་ ནི་ ཆོས་མ་ ཡིན་པ་ ལ་ བརྟེན་ ནས་ གནས་ སོ །_།
en: ‘Non-Dharma can never defeat Dharma. We always keep the Dharma before us. You remain supported by non-Dharma.’

source: དེ་ལྟ ར་ དེ་དག་ ལྷ་ རྣམས་ ཀྱིས་ སྤྱོས་པ་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གྱིས་ ལྷ་མ་ ཡིན་ ཐམས་ཅད་ བསྡུས་ ཏེ་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: $263 “Seeing this as mockery by the gods, the asura ruler Rāhu will summon all the asuras to storm the gods.

source: དེ་ལྟ ར་ དེ་དག་ འོང་བ་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་ རྣམས་ ཀྱང་ ལྷ་མ་ ཡིན་ དག་ ག་ལ་བ་ དེར་ རྒྱུག་པ ར་ བྱེད་ དེ །_ ལྷ་ དང་ ལྷ་མ་ ཡིན་ དེ་དག་ མཚོན་ཆ་ དུ་མ་ དང་ ལྡན་པ འི་ གཡུལ་ ཤིན་ཏུ་ མི་བཟད་པ་ བཀྱེ་བ ར་ གྱུར་ ཏོ །_།
en: When the gods see them coming, they will rush forth to meet them, and thus the gods and asuras will engage in an utterly unbearable battle fought with masses of weapons.

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ ཆོས་ བརྗོད །_ བདེན་པ འི་ བྱིན་ གྱིས་ བརླབས་ བྱས །_ དཀོན་མཆོག་ གསུམ་ ལ་ སྐྱབས་ སུ་ འགྲོ་བ་ ཡིད་ ལ་ བྱས་ ནས །_
en: At some point, the gods will recite the Dharma, invoke the blessing of the truth, and mentally take refuge in the Three Jewels.

source: ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: Then they shall advance.

source: ལྷ་ དེ་དག་ མཐོང་ མ་ ཐག་ ཏུ་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ དེ་ ཐམས་ཅད་ བརྒྱ འམ་ སྟོང་ དུ་ བཅོམ་ མོ །_།
en: At that point, the mere sight of the advancing gods will make the entire army of asuras collapse in hundreds and thousands of ways.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ དེ་དག་ ཐམས་ཅད་ ས འི་ འོག་ ག་ལ་བ་ དེར་ བྲོས་ སོ །_།
en: All the asuras will then flee below the ground.

source: ཀླུ་ ཆོས་ དང་ མི་ ལྡན་པ་ རབ་ འཇོམས་ ལ་སོགས་ པས་ ལྷ་མ་ ཡིན་ དེ་དག་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $264 “Pramatha and other such unrighteous nāgas will now call out to the asuras,

source: ལྷ་མ་ ཡིན་ དག་ བདག་ཅག་ བོར་ ནས་ ཅི་སྟེ་ འབྲོས །_
en: ‘Asuras, why do you abandon us and flee?

source: ཀླུ་ འཇོག་པོ་ དང་ །_ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་པ་ དེ་དག་ བདག་ [36a] ཅག་ གིས་ ཐུབ་ ན །_ ཁྱེད་ ཀྱིས་ ལྷ་ འདི་དག་ འབའ་ཞིག་ ཐུབ་པ ར་ འགྱུར་ རོ །_།
en: We can get the better of Takṣaka, Vāsuki, and other such nāgas, [36.a] so you should also be able to vanquish the gods.

source: གང་དེ་ ལྟར་ འཇིགས་ པར་ གནས་ ན །_ རང་ གི་ དཔུང་ ཉམས་དྲོད་ མེད་པར་ ཅིའི་ཕྱིར་ ས འི་ འོག་ ནས་ ལྡང་ །_ ལྷ་ རྣམས་ དང་ ལྷན་ཅིག་ ཅིའི་ཕྱིར་ འགལ་བ ར་ བྱེད །_
en: If you are so afraid, then why did you bring your cowardly army up from beneath the earth to fight with the gods in the first place?

source: འགལ་བ འི་ རང་བཞིན་ ཅན་ ཁྱེད་ ནི་ ས འི་ འོག་ ཏུ་ འདོང་ དུ་ཡོད་ གྲང་ ན་ ངེད་ གར་ འདོང་ །_
en: If you hostile ones now retreat below the earth, where are we supposed to go?

source: འཇོག་པོ་ དང་ ནོར་ རྒྱས་ ཀྱི་ བུ་ ལ་སོགས་ པས་ བཅོམ་པ་ གར་ འདོང་ །_
en: Where should we go when Takṣaka, Vāsuki, and the others attack?’

source: ལྷ་མ་ ཡིན་ དེ་དག་ གིས་ དེ་སྐད་ ཐོས་ ནས །_ དེ་ནས་ ཡང་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ གཡུལ་འགྱེད་ དུ་ སླར་ ལོག་ གོ _།
en: $265 “When the asuras hear this, they will once more return to battle the gods.

source: དེ་ནས་ ཡང་ ཐོགས་པ་ མེད་པ འི་ བློ་ ཅན་ དེ་དག་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ ཐམས་ཅད་ འབད་ དེ་ བརྒྱུགས་ སོ །_།
en: Yet, the gods will be undeterred and diligently charge forth to fight the asuras.

source: དེ་ནས་ དེ་དག་ འོང་བ་ མངོན་པར་ མཐོང་ སྟེ །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ བཟློག་ པར་མ་ ནུས་ སོ །_།
en: When the asuras see that the gods are storming toward them, they will become unable to resist any longer.

source: དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ ལྷན་ཅིག་ ཏུ་ ས འི་ འོག་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: At that point, the asura rulers Rāhu and Firm will jointly retreat to their subterranean dwellings.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ དཔུང་ དེ་ལྟ ར་ ཉམས་པ་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ ཁ་ཅིག་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གནས་ གསུམ་པ་ ན་ གནས་པ་ ག་ལ་བ་ དེར་ བརྒྱུགས་ ཏེ །_
en: $266 “Seeing the asura army defeated makes some of the asuras rush to see the asura ruler of the third level.

source: འདི་ལྟར་ རྒྱལ་པོ་ ཆེན་པོ་ མེ་ཏོག་ ཕྲེང་ བཞེངས །_
en: They will say to him, ‘Arise, O great king Puṣpamāla!

source: ལྷ འི་ ཚོགས་ དེ་དག་ བཟློག་ ཏུ་ མི་ རུང་ ལ །_ ལྷ་མ་ ཡིན་ ཐམས་ཅད་ ཕམ་པ ར་ བྱས་ ཏེ་ ཕྱོགས་ ཀུན་ དུ་ བཀོད་པ ར་ གྱུར་ ཏོ །_།
en: The throng of gods has been unstoppable, and so all the asuras have been defeated and are now scattered about everywhere.

source: ཁྱོད་ ཀྱིས་ ནི་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ དུ་མ ར་ རྣམ་པར་ རྒྱལ་བ་ བརྙེས་ ལ །_ རྒྱལ་བ་ བརྙེས་པ ར་ འགྱུར་ གྱིས །_ ཁྱོད་ ཀྱིས་ དེ་དག་ དགོངས་ ཏེ་ བཞེངས །_
en: In the war against the gods, you previously achieved numerous victories for the asuras, and must now do so once again. Please pay heed to these matters and arise!

source: ལྷ འི་ དབང་པོ་ བཅས་པ་ ལས་ རྒྱལ་བ ར་ སྤྱོན་ ཅིག _།
en: Go forth and vanquish the gods and their king!’

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ གིས་ དེ་དག་ ཐམས་ཅད་ ཡིད་ ལ་ བཟུང་ ནས་ མཚོན་ཆ་ དང་ ལག་ཆ་ རྣམ་པ་ སྣ་ཚོགས་ ཐོགས །_
en: $267 “Keeping those words in mind, the asura ruler Puṣpamāla will then take up various weapons and arms.

source: ལྷ་མ་ ཡིན་ བྱེ་བ་ དུ་མ ས་ ཡོངས་སུ་ བསྐོར །_ ནམ་མཁ འི་ ཕྱོགས་ ཐམས་ཅད་ སྒྲ་ རྣམས་ ཀྱིས་ ཡོངས་སུ་ འགེངས་ ཤིང་ །_ དེ་དག་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: Surrounded by millions of asuras, and with their rumbling filling the sky, he will depart for the battlefield of the war between the gods and the asuras.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ སྒྲ་གཅན་ གྱིས་ སྟོང་ སྙེད་ འོང་བ་ མངོན་པར་ མཐོང་ ནས །_
en: $268 “When the asura ruler Rāhu sees them coming by the thousands, he will say to Firm,

source: བརྟན་པ་ ལ་ སྨྲས་པ །_ འདི་དག་ ནི་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ ཡིན་ ཏེ །_
en: ‘That is the army of the asura ruler Puṣpamāla.

source: བདག་ཅག་ གི་ འབྱོར་པ ར་ བྱ་ [36b] བ་ དང་ །_ ལྷ་ རྣམས་ ཕམ་པ ར་ བྱ་བ འི་ ཕྱིར་ འོང་ གིས །_
en: They are coming to our assistance [36.b] to help us defeat the gods.

source: ལྷ་མ་ ཡིན་ དེ་དག་ སླར་ ཟློག་ ཤིག _།
en: Therefore, let the asuras turn them back!

source: འདི་ ནི་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བདག་ཅག་ གི་ འབྱོར་པ ར་ བྱ་བ འི་ ཕྱིར་ འོང་ ངོ་ །_།
en: This army is here to assist us, the asura rulers.’

source: དེ་ ཐོས་ ནས་ ལྷ་མ་ ཡིན་ དག་ དེ་ནས་ ཡང་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ ཕྱིར་ལོག་ གོ །_། དེ་ནས་ ཡང་ དེ་དག་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ ལྷགས་ སོ །_།
en: $269 “When they hear this news, the asuras will again return to war, marching to where the gods of the Four Great Kings have assembled.

source: དེ་དག་ ལྷགས་པ་ ན་ ལྷ་ རྣམས་ ཀྱིས་ འདི་སྐད་ སྨྲས་ སོ །_།
en: When the gods see them, they will say,

source: དུད་འགྲོ་ ཁྱེད་ ཡུན་ ཇི་སྲིད་ ཅིག་ ཏུ་ དེ་ སྐྱོང་བ ར་ བྱེད །_
en: ‘You animals, how long can you be kept in one place?

source: གཏི་མུག་ གིས་ བསྒྲིབས་པ་ ཁྱེད་ རྣམས་ རང་ གི་ དཔུང་ གཞིག་ པར་ བྱ་བ འི་ ཕྱིར་ལོག་ གམ །_
en: Have you returned here, obscured and bewildered, to destroy your own army?’

source: དེ་སྐད་ སྨྲས་ ནས །_ དེ་ནས་ ཡང་ ལྷ་ རྣམས་ ལྷ་མ་ ཡིན་ ག་ལ་བ་ དེར་ བརྒྱུགས་ སོ །_།
en: With those words, the gods will then charge toward the asuras.

source: དེ་ནས་ མེ་ཏོག་ ཕྲེང་ གིས་ ལྷ་མ་ ཡིན་ དེ་དག་ ལ་ འདི་སྐད་ སྨྲས་ སོ །_།
en: $270 “At this point Puṣpamāla will say to the asuras,

source: ལྷ་མ་ ཡིན་ རྣམས་ བཟླུམས་ ཏེ་ འཁོད་པ་ ཅི་ སེམས་ ལྷ་ རྣམས་ ལ་ གནོད་པ་ ཅིའི་ཕྱིར་ མི་ བྱ །_
en: ‘The asuras stand united. So, what do you think?

source: སོ་སོ ར་ མི་ འཐུན་ པར་ འཁོད་པ་ ལྷ་ རྣམས་ ཕམ་པ ར་ མི་ བྱ་ འམ །_།
en: Shouldn’t we now bring harm upon the gods? Shouldn’t we now defeat the disarrayed gods?

source: འདི་ ན་ བདག་ གནས་པ་ གཅིག་པུ ས་ ལྷ་ ཐམས་ཅད་ ལས་ རྒྱལ་བ ར་ ནུས་ ན །_ གང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ་ དང་ །_ སེང་གེ་ མོ འི་ བུ་ སྒྲ་གཅན་ བདག་ཅག་ གི་ གྲོགས་ སུ་ གྱུར་པ ས་ སྨོས་ ཀྱང་ ཅི་ དགོས་ ཏེ །_
en: My realm can defeat all the gods unassisted, so there is no need to mention what we can achieve when the asura rulers Firm and Rāhu, the son of the lioness, are with us as well.

source: འཇིགས་ པར་མ་ བྱེད་ ཅིག _།
en: Have no fear!

source: ཁྱེད་ཅག་ ཀུན་ ཀྱང་ ཐམས་ཅད་ དུ་ གཡུལ་ གྱི་ འཇིགས་པ་ མེད་པ་ ཡིན་ ན །_ སྒྱིད་ལུག་པ་ དེས་ མ་ ཆོག་ གམ །_
en: You needn’t ever fear the battlefield, so enough of this disheartened sentiment.

source: ལྷ་མ་ ཡིན་ རྣམས་ རྒྱལ་བ ར་ གྱུར་ཅིག _།
en: The asuras shall be victorious!

source: ལྷ་མ་ ཡིན་ རྣམས་ མཐུ་རྩལ་ དང་ བཅས་པ ས་ རྣམ་པར་ རྒྱལ་བ ར་ གྱུར་ཅིག _།
en: The asuras with their mighty powers shall triumph!’

source: དེ་སྐད་ ཅེས་ སྨྲས་ ནས །_ དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རྣམས་ དང་ ལྷན་ཅིག་ ལྷ་ མེ་ཏོག་ ཕྲེང་ཐོགས་ དང་ །_ རྟག་ ཏུ་ མྱོས་ གནས་ དང་ །_ ལག་ ན་ཡོལ་ གོ་ ཐོགས་ དང་ །_ པི་ བང་ ཅན་ གསུམ་པ འི་ ལྷ འི་ དབང་པོ་ རྣམས་ བཻ་ ཌཱུརྱའི་ རི འི་ རྩེ་མོ ར་ འཛེགས་ ཏེ
en: $271 “Having proclaimed this, the asura ruler Puṣpamāla and the other asura rulers unite, while the divine rulers of the flower garland bearers, the ever-infatuated gods, the vessel bearers, and the triple-lute-bearers climb to the summit of the beryl mountain.

source: འཁོད་ ཅིང་ ཐམས་ཅད་ དུ་ ཁྱབ་པ ར་ བྱས་ ནས་ སྲེད་པ་ སྐྱེ་ སྟེ །_ འདི་ལྟར་ སུམ་ཅུ་རྩ་གསུམ་པ འི་ ལྷ་ རྣམས་ དང་ བརྒྱ་བྱིན་ མེད་ ཀྱང་ བདག་ཅག་ འབའ་ཞིག་ གིས་ ལྷ་མ་ ཡིན་ རྣམས་ ཆོས་ གཅིག་ དང་ བཅས་པ ས་ ལན་ དུ་མ ར་ ཐུབ་པ ར་ བྱས་ སོ །_།
en: There, they will spread out and take their positions. Enthusiastically, they will think, ‘Even without Śakra and the gods of the Heaven of the Thirty-Three, we alone have often defeated the asuras due to possessing the same Dharma.’#246[37.a]

source: དེ་དག་ གིས་ དེ་སྐད་ སྨྲས་པ་ དང་ །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ རྒྱ་ [37a] མཚོ་ དེ་ཉིད་ ཁྱབ་པ ར་ བྱས་ ནས །_ དེ་ནས་ ཡང་ གཡུལ་འགྱེད་ པར་ བྱུང་ ངོ་ །_།
en: $272 “Meanwhile, the asuras will spread across the sea, plowing forward to wage war.

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ དེ་དག་ འོང་བ་ མངོན་པར་ མཐོང་ ནས་ སྨྲས་པ །_
en: When the gods see the advancing asuras, they will say,

source: འདི་ལྟར་ ལྷ་མ་ ཡིན་ བདག་ཉིད་ ཐམས་ཅད་ དཔུང་ ཆེས་ འཕེལ་ ཏེ །_ འོང་ གིས་ འདི་དག་ ནི་ ངེས་པ ར་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ གསུམ་པ་ མེ་ཏོག་ ཕྲེང་ ཡིན་ ཏེ །_
en: ‘The one who has assembled this great army of asuras that is now bearing down on us is certainly Puṣpamāla, the third ruler of the asuras.’

source: དེ་དག་ འོང་བ་ ལྟ་ ཞིང་ དེ་དག་ ལ་ དེ་སྐད་ སྨྲས་པ་ དང་ །_ ལྷ་མ་ ཡིན་ གཡུལ་འགྱེད་ པར་ མདུན་ ཉིད་ ན་ འཁོད་ དོ །_།
en: As they watch them approach, they talk about them and take positions to confront them head-on in battle.

source: དེ་ནས་ ལྷ་ རྣམས་ ཀྱིས་ དེ་དག་ མཐོང་ ནས་ སྨྲས་པ །_
en: $273 “To the asuras the gods will then say,

source: ཁྱེད་ གང་ གིས་ བསླུས་ ནས་ འོངས །_
en: ‘Who has fooled you into coming here?

source: ད་དུང་ དུ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ མར་ འཛིན་པ །_ ཕ ར་ འཛིན་པ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ །_ བྲམ་ཟེ ར་ འཛིན་པ །_ དགེ་བ་ དོན་ དུ་ གཉེར་བ །_ དགེ་བ་ ལ་ ཞུགས་པ་ ཡོད་ དེ
en: There are still righteous people who follow the Dharma, who respect their mothers, respect their fathers, respect mendicants, and respect brahmins, who persevere for the sake of virtue, and are engaged in virtue.

source: དེ་དག་ ཤི་བ འི་ དུས་བྱ ས་ ནས་ ལྷ་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ རོ །_།
en: When they die, such people are born as gods.

source: དེ་ ནི་ ངེད་ ཡིན་ ཏེ །_ ཁྱེད་པ ས་ ཆེས་ དཔུང་ ཆེ་ ལ་ ཆེས་ གཙོ་བོ་ ཡིན་ ནོ །_།
en: They make up our army, which is much greater and more significant than yours.

source: དེ་ལྟ་བས་ན་ ཆོས་ བསྒྲུབས་པ་ བདག་ཅག་ ལ་ ཁྱེད་ ཀྱིས་ མངོན་པར་ མ་ གཙེ་ ཤིག _།
en: Therefore, do not try to harm us, we who practice the Dharma.

source: བདག་ཅག་ ལ་ ཁྱེད་ ཀྱིས་ ཅིའི་ཕྱིར་ གཙེ །_
en: Why would you harm us?’

source: དེ་ནས་ དེ་སྐད་ སྨྲས་པ་ དང་ །_ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ལྷ་ རྣམས་ ཀྱི་ ཚིག་ རྩིས་ ལ་མ་ ཆགས་པ ར་ བྱས་ ནས ལྷ་ རྣམས་ དང་ གཡུལ་འགྱེད་པ འི་ ཕྱིར་ ལྷགས་ སོ །_།
en: $274 “Yet the asuras will disregard those words and instead proceed to battle with the gods.

source: དེ་ནས་ ལྷ་ རྣམས་ ཡང་ ལྷ་མ་ ཡིན་ རྣམས་ ག་ལ་བ་ དེར་ ནམ་མཁའ་ བཀང་ ནས་ ལྷ་མ་ ཡིན་ རྣམས་ གཞོམ་པ འི་ ཕྱིར་ དང་ །_ དེ་དག་ ཕན་ཚུན་ རྒྱལ་བ ར་ བྱ་བ འི་ ཕྱིར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: Filling the sky, the gods will then come forth to meet and defeat the asuras, and each side will surge forth to defeat the other.

source: དེ་ནས་ ཡང་ དེ་དག་ གཡུལ་ གྱི་ རྣམ་པ་ དེ་ལྟ་ བུ་ བཀྱེ་ སྟེ །_ སྒྲ་ གང་ གིས་ རྒྱ་མཚོ་ ན་ གནས་པ་ ཉ་ དང་ །_ སྲོག་ཆགས་ དུང་ དང་ །_ ཆུ་སྲིན་ དང་ །_ ཆུ་སྲིན་ བྱིས་པ་ གསོད་ དང་ །_ ཉ་ མིད་ དང་ །_ ཉ་ མིད་ ཆེན་པོ་ དང་ །_ ཆུ་སྲིན་ ན་ཀྲ་ དང་ །_ ཆུ་སྲིན་ དུ་ ན་ དྷུ་ གསོད་ མང་པོ་ རྣམས་ ཀྱི་ སྙིང་ བརྒྱ འམ་ སྟོང་ དུ་ རྣམ་པར་ གས་ སོ །_།
en: The battle that follows is such that the hearts of many fish, shellfish, crocodiles, infant-eating crocodiles, sea crocodiles, great sea crocodiles, alligators, and other ferocious crocodiles#247 will burst into a hundred or a thousand pieces.

source: དེ་དག་ མཚོན་ཆ་ དཔེ་མེད་པ་ དུ་མ་ ཆར་ གྱི་ རྒྱུན་ལྟར་ ཤིན་ཏུ་ འབབ་པ ས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གཡུལ་ བཀྱེའོ །_།
en: Thus, the gods and asuras will fight each other in a continuous and unparalleled downpour of numerous weapons.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ གིས་ ལྷ་མ་ ཡིན་ དེ་དག་ བཀྱེ་ ནས་ གཅིག་པུ་ འདུག་ སྟེ ལྷ་ རྣམས་ ལ་ འདི་སྐད་ སྨྲ འོ །_། ང་ཉིད་ ཀྱིས་ ཡུན་རིང་ དུ་ གཡུལ་ འདིར་ [37b] མ་ འདུག་ སྟེ །_
en: $275 “The asura ruler Puṣpamāla, who stands alone, having dispatched the other asuras, will address the gods, saying, ‘This battle will not take me long, [37.b] and I am certain to win.

source: དེ་ འདུག་ ན་ ནི་ རྣམ་པར་ རྒྱལ་བ་ ཐོབ་པ ས་ དང་ ཁྱེད་ རྣམས་ གཞོམ་པ འི་ ཕྱིར་ དང་ །_ ལྷ་མ་ ཡིན་ རྣམས་ འབྱོར་པ ར་ བྱ་བ འི་ ཕྱིར་ འོངས་པ་ ཡིན་ ནོ །_།
en: I have come here to vanquish you all and assist the asuras.

source: ང་ འབའ་ཞིག་ འདུག་པ ས་ ལྷ་དབང་པོ་ དང་ བཅས་པ་ ཡང་ མདུན་ དུ་ འདུག་ མི་ ནུས་ ན །_ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ འབའ་ཞིག་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས་ ཏེ །_ ངས་ ཕམ་པ ར་ བྱ འོ །_།
en: At my hand, all the gods will fall, including their ruler, so no need to mention the gods of the realm of the Four Great Kings. You will surely be vanquished!’

source: དེ་སྐད་ སྨྲས་ ནས །_ ལྷ་ རྣམས་ ག་ལ་བ་ དེར་ འགྲོ་བ ར་ བྱེད་ དོ །_།
en: Having spoken these words, he will then rush toward the gods.

source: ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ རྣམས་ ཀྱིས་ དེ་ འོང་བ ར་ མངོན་པར་ མཐོང་ ནས །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ དེ་ གཞོམ་པ འི་ ཕྱིར་ ག་ལ་བ་ དེར་ འདོང་བ ར་ བྱེད་ དོ །_།
en: $276 “When the vessel-bearer gods see Puṣpamāla approaching, they will come forth to vanquish him.

source: དེ་ནས་ རྒྱ་མཚོ འི་ དབུས་ ནས་ རི་ དཔག་ཚད་ ལྔ་པ་ དང་ །_ དཔག་ཚད་ བཞི་པ་ དང་ །_ དཔག་ཚད་ གསུམ་པ་ དང་ །_ དཔག་ཚད་ གཉིས་པ་ དང་ །_ དཔག་ཚད་ ཀྱི་ ཚད་ རབ་ཏུ་ འབར་བ་ དག་ ཕྱུང་ ཞིང་ ཕྱུང་ ཞིང་ལྷ་ ལག་ ན་ཡོལ་ གོ་ ཐོགས་པ་ ག་ལ་བ་ དེར་ འཕེན་པ ར་ བྱེད་ དོ །_།
en: Standing at the center of the ocean, the asura ruler Puṣpamāla will then unearth flaming mountains measuring five, four, three, two, or one league, and hurl these mountains at the vessel-bearer gods.
